
&НаСервере
Процедура СобратьТабличныйДокумент(НовыйТабличныйДокумент, ТабличныеДокументы)

		Для Каждого ТабДокумент Из ТабличныеДокументы Цикл
			НовыйТабличныйДокумент.Вывести(ТабДокумент.Значение);
			НовыйТабличныйДокумент.ВывестиВертикальныйРазделительСтраниц();
		КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура Расш1_СохранитьВПДФПосле(Команда)
	
	Если КомплектПечатныхФорм.НайтиСтроки(Новый Структура("Печатать", Истина)).Количество() > 0 Тогда
		
		ИменаМакетов = ПодготовитьНастройкиДляПечати();
		
		ПечатныеФормы = УправлениеПечатьюВызовСервера.СформироватьПечатныеФормыДляБыстройПечати(
			ТипОбъекта, ИменаМакетов, Объекты.ВыгрузитьЗначения(), Новый Структура("ФиксированныйКомплект", Истина));
			
		НовыйТабличныйДокумент = Новый ТабличныйДокумент;
		СобратьТабличныйДокумент(НовыйТабличныйДокумент, ПечатныеФормы.ТабличныеДокументы);
		
		НовыйТабличныйДокумент.Показать();
		//Если Не ПустаяСтрока(КлючНастроек) Тогда
		//	СохраняемыеНастройкиПечатныхФорм = Новый Массив;
		//	Для Каждого НастройкаПечати Из КомплектПечатныхФорм Цикл
		//		СохраняемаяНастройка = Новый Структура("Имя, Копий, Печатать");
		//		ЗаполнитьЗначенияСвойств(СохраняемаяНастройка, НастройкаПечати);
		//		СохраняемыеНастройкиПечатныхФорм.Добавить(СохраняемаяНастройка);
		//	КонецЦикла;
		//	СохранитьНастройкиПечатныхФорм("НастройкиПечатныхФормКомплект", КлючНастроек, СохраняемыеНастройкиПечатныхФорм);
		//КонецЕсли;
		
		//Закрыть();
		
	Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Выберите хотя бы одну печатную форму для печати.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КомплектПечатныхФорм");
		
	КонецЕсли;

КонецПроцедуры
